AFKSystem/src/Documents/ПродажаТоваров/ПродажаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаТоваров</name>
  <registerRecords>AccountingRegister.Основной</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>InformationRegister.ЦеныТоваров</registerRecords>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AFKSystem/src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AFKSystem/src/AccountingRegisters/Основной/Основной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Основной</name>
  <chartOfAccounts>ChartOfAccounts.Основной</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <accountingFlag>ChartOfAccounts.Основной.AccountingFlag.Суммовой</accountingFlag>
  </resources>
</mdclass:AccountingRegister>

AFKSystem/src/InformationRegisters/ЦеныТоваров/ЦеныТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныТоваров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AFKSystem/src/ChartsOfAccounts/Основной/Основной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Основной</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>10</code>
    </items>
    <items>
      <name>РасчетыСКонтрагентами</name>
      <description>Расчеты с контрагентами</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Доход</name>
      <description>Доход</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>Себестоимость</description>
      <code>91</code>
    </items>
  </predefined>
  <accountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

AFKSystem/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Партнеры</types>
  </type>
  <predefined>
    <items>
      <name>Договор</name>
      <description>Договор</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Партнеры</name>
      <description>Партнеры</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

AFKSystem/src/Documents/ПродажаТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.Основной.Записывать = Истина;
	Движения.Основной.Записать();
	
	цЗапись = РегистрыСведений.ЦеныТоваров.СоздатьНаборЗаписей();
	цЗапись.Отбор.Регистратор.Установить(ССылка);
	
	
	
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрБухгалтерии.Основной");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.УстановитьЗначение("Счет", ПланыСчетов.Основной.Товары);
	Элемент.ИсточникДанных = Товары;
	Элемент.ИспользоватьИзИсточникаДанных(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "Номенклатура");
	Блокировка.Заблокировать();
	
	БлокировкаРН = Новый БлокировкаДанных;
	ЭлементРН = БлокировкаРН.Добавить("РегистрНакопления.ОстаткиТоваров");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	//Элемент.УстановитьЗначение("Номенклатура"
	ЭлементРН.ИсточникДанных = Товары;
	ЭлементРН.ИспользоватьИзИсточникаДанных("Номенклатура" , "Номенклатура");
	БлокировкаРН.Заблокировать();
	
	 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажаТоваровТовары.Номенклатура КАК Номенклатура,
		|	СУММА(ПродажаТоваровТовары.Количество) КАК Количество,
		|	СРЕДНЕЕ(ПродажаТоваровТовары.Цена) КАК Цена,
		|	СУММА(ПродажаТоваровТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
		|ГДЕ
		|	ПродажаТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажаТоваровТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТовары.Номенклатура КАК Номенклатура,
		|	втТовары.Количество КАК Количество,
		|	втТовары.Цена КАК Цена,
		|	втТовары.Сумма КАК Сумма,
		|	ЕСТЬNULL(ОстаткиТоваров.КоличествоОстаток, 0) КАК Остаток,
		|	ЕСТЬNULL(БухОстатки.СуммаОстатокДт, 0) КАК СуммаОстаток
		|ИЗ
		|	втТовары КАК втТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						втТовары.Номенклатура КАК Номенклатура
		|					ИЗ
		|						втТовары КАК втТовары)) КАК ОстаткиТоваров
		|		ПО втТовары.Номенклатура = ОстаткиТоваров.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Основной.Остатки(
		|				&МоментВремени,
		|				Счет = &Счет,
		|				&МассивСубконто,
		|				Субконто1 В
		|					(ВЫБРАТЬ
		|						втТовары.Номенклатура КАК Номенклатура
		|					ИЗ
		|						втТовары КАК втТовары)) КАК БухОстатки
		|		ПО втТовары.Номенклатура = БухОстатки.Субконто1";
	
	МассивСубконто = Новый Массив;
	МассивСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Запрос.УстановитьПараметр("МассивСубконто", МассивСубконто);
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Основной.Товары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > Выборка.Остаток Тогда
			Сообщить("Не хватает остатка...");
			Отказ= Истина;
			Прервать;
		КонецЕсли;	
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.РАсход;
		Движение.Период = Дата;
		Движение.Номенклатура = ВЫборка.Номенклатура;
		Движение.Количество = ВЫборка.Количество;
		
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетКт = ПланыСчетов.Основной.Товары;		
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		Движение.СчетДт = ПланыСчетов.Основной.Доход;
		Движение.Сумма = Выборка.СуммаОстаток *(ВЫборка.Количество/Выборка.Остаток);
		
		Движение = Движения.Основной.Добавить();
		Движение.Период = Дата;
		Движение.СчетДт = ПланыСчетов.Основной.РасчетыСКонтрагентами;		
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Партнеры] = Партнер;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Договор] = Договор;
		Движение.СчетКт = ПланыСчетов.Основной.Себестоимость;
		Движение.Сумма = Выборка.Сумма;
		
		Запись = цЗапись.Добавить();
		Запись.Период = Дата;
		Запись.Номенклатура = Выборка.Номенклатура;
		Запись.ЦенаПродажи = Выборка.Цена;
		Запись.Регистратор = Ссылка;
		
	КонецЦикла;
	
	цЗапись.Записать();

КонецПроцедуры
